"SEND" = "SEND";
"RECEIVE" = "RECEIVE";
"BUY" = "BUY";
"SWAP" = "SWAP";
"swap" = "Swap";
"send" = "Send";
"receive" = "Receive";
"total asset" = "TOTAL ASSET (≈%@)";
"from" = "From";
"to" = "To";
"amount" = "Amount";
"send max" = "Send Max";
"network fee" = "Network Fee";
"ok" = "OK";
"close" = "Close";
"failed" = "Failed";
"success" = "Success";
"mint address" = "Mint address";
"contract address" = "Contract address";
"owner" = "Owner";
"artist royalties" = "Artist Royalties";
"website" = "Website";
"query details" = "Query Details";
"you" = "YOU";
"receiver" = "Receiver";
"address" = "Address";
"send nft alert" = " *Make sure you enter the correct Receiver's address.Once the transaction has been made, your asset cannot be recovered.";
"token" = "Token";
"collection" = "Collection";
"all" = "All";
"in" = "In";
"out" = "Out";
"txid" = "TxID";
"deposit" = "Deposit";
"only support" = "Only support %@ related assets";
"add at least" = "Please add at least ";
"balance" = "Balance";
"buy from" = "Buy with Debit / Credit Card / Apple Pay / Google Pay";
"func from" = "Fund from Wallet or Exchange";
"confirm send" = "Confirm to Send";
"no record" = "No records yet";
"no record message" = "As you start to use your wallet, you will see your activity here.";
"no results" = "No results were found for your search.";
"copied address" = "Copied Address";
"copied private key" = "Copied Private Key";
"copy address" = "Copy Address";
"send nft" = "Send NFT";
"wallet" = "Wallet";
"wallets" = "Wallets";
"enter correct address" = "Please enter the correct address";
"search for token" = "Search for token";
"cancel" = "Cancel";
"go to settings" = "Go to Settings";
"camera access not enabled" = "Camera Access Not Enabled";
"no transfer address" = "Please enter the transfer address";
"wrong transfer address" = "Please enter the correct address";
"no transfer amount" = "Please enter the transfer amount";
"no trade yourself" = "You can't send to yourself";
"insufficent balance" = "Insufficient wallet balance";
"max fee" = "Max Fee";
"max amount"= "Max Amount";
"refresh in" = "Refresh in %@s";
"total" = "Total";
"loading..." = "Loading...";
"network wrong" = "Network connection error";
"edit priority" = "Edit Priority";
"estimate" = "Estimate";
"gas limit" = "Gas Limit";
"max priority fee" = "Max Priority Fee";
"save" = "Save";
"slow" = "Slow";
"standard" = "Standard";
"fastest" = "Fastest";
"advanced options" = "Advanced options";
"gas limit as least" = "Gas limit must be at least %@.";
"max priority fee low" = "Max Priority Fee is low for current network conditions.";
"max priority fee high" = "Max Priority Fee is higher than necessary.";
"max fee low" = "Max Fee is low for current network conditions.";
"max fee high" = "Max Fee is higher than necessary.";
"pending" = "PENDING";
"nonce" = "Nonce";
"speedUp" = "Speed Up";
"submit" = "Submit";
"speed up transaction" = "Speed up transaction";
"cancel transaction" = "Cancel transaction";
"new network fee" = "New Network Fee";
"max cant less than max priority" = "Max fee cannot be lower than max priority fee.";
"insufficent native" = "You do not have enough %@ in your account to pay for transaction fees.";
"add custom token" = "Add Custom Token";
"token address" = "Token Address";
"token symbol" = "Token Symbol";
"token of precision" = "Token of Precision";
"token address cant be empty" = "Token address can't be empty.";
"token symbol cant be empty" = "Token symbol can’t be empty.";
"token of precision cant be empty" = "Token of precision can’t be empty.";
"token address must be a valid address" = "Token address must be a valid address.";
"add" = "Add";
"would you like to import these tokens" = "Would you like to import these tokens?";
"address book" = "Address Book";
"my wallets" = "My Wallets";
"manage wallet" = "Manage Wallet";
"currency unit" = "Currency Unit";
"setting" = "Setting";
"new address" = "New Address";
"edit address" = "Edit address";
"address infomation" = "%@ Address Infomation";
"click to add address book" = "Click to add to your address book";
"invalid wallet address" = "Invalid wallet address";
"add new address" = "Add New Address";
"name" = "Name";
"delete" = "Delete";
"edit" = "Edit";
"confirm delete address" = "Confirm delete address?";
"add to address book" = "Add to address book";
"confirm" = "Confirm";
"send transaction success" = "Send Transaction has been successful";
"send transaction failure" = "Send Transaction has failed";
"custom token info" = "Anyone can create a token, including creating fake versions of existing tokens.";
"recent recevier" = "Recent: %@";
"token not found" = "The token was not found.";
"added token" = "Added token";
"token not added" = "Token not added";
"networks" = "Networks";
"test network" = "Test Network";
"particle auth wallet" = "Particle Auth Wallet";
"import eth wallet" = "Import ETH Wallet";
"import sol wallet" = "Import SOL Wallet";
"connected wallet" = "Connected Wallet";
"add a new wallet" = "Add a New Wallet";
"change wallet name" = "Change wallet name";
"logout" = "Logout";
"disconnect" = "Disconnect";
"delete" = "Delete";
"delete wallet" = "Delete this wallet";
"delete wallet description" = "You will delete this wallet, and you will not be able to retrieve it later.";
"change" = "Change";
"export private key" = "Export Private Key";
"private key" = "Private Key";
"login with particle auth" = "Login with Particle Auth";
"select from album" = "Select from album";
"withdraw" = "WITHDRAW";
"description" = "Description";
"attributes" = "Attributes";
"details" = "Details";
"detail" = "Detail";
"unfold" = "More";
"fold" = "Less";
"nft no attributes" = "This NFT has no attributes.";
"nft no description" = "This NFT has no Description.";
"connect" = "Connect";
"import" = "Import";
"not install" = "You haven't installed this wallet.";
"not support" = "The wallet is not support current chain.";
"empty nft" = "This NFT has no pictures";
"collection empty text" = "As you get NFTs or other collections, you can view them here.";
"address book empty text" = "You can click the button to add a new address.";
"my wallets empty text" = "You dont have other wallets";
"transaction empty text" = "As you start to use your wallet, you will see your activity here.";
"enter private key" = "Please input private key or mnemonic";
"wallet name" = "Wallet Name";
"choose network" = "Choose Network";
"wrong private key" = "Please re-enter the correct Private Key";
"wrong qrcode" = "QR code not recognized";
"qrcode is not address" = "QR code is not a valid address";
"address exist" = "Address already exist";
"wallet exist" = "The wallet already exists, ths same cannot be imported";
"not enough token to swap" = "Not enough Token to complete this transaction";
"not enough fee to swap" = "Not enough Fee to complete this transaction";
"you pay" = "You Pay";
"you receive" = "You Receive";
"rate" = "Rate";
"slippage tolerance" = "Slippage Tolerance";
"slippage tolerance message" = "Your transaction will fail if the price changes unfavorably more than this percentage.";
"price impact" = "Price Impact";
"price impact message" = "The difference between the market price and estimated price based on your trade size.";
"swap token" = "Swap Token";
"continue" = "Continue";
"select token" = "Select a token";
"swap confirm message" = "The waiting time is up. \nUpdate price to continue trading.";
"swap now" = "Swap Now";
"update price" = "Update Price";
"max" = "Max";
"transaction submitted" = "Transaction Submitted";
"select token error" = "Please select input and output token";
"approve token" = "Allow Particle to use your %@";
"login with" = "Login with %@";
"email" = "Email";
"phone number" = "Phone Number";
"login methods" = "Login Methods";
"or" = "OR";
"active" = "Active";
"connected sites" = "Connected Sites";
"disconnect" = "Disconnect";
"connect to this site" = "Connect to this site";
"not connected to any sites" = "Not connected to any sites";
"scan title" = "Scan QR Code";
"scan message" = "Initiate a transfer or connect with WalletConnect";
"approve connect message" = "Allow this site to see address, account balance, activity and suggest transactions to approve.";
"approve switch network" = "Allow this site to switch the network";
"disconnect connected site" = "Are you sure you want to disconnect? You may lose site functionality.";
"connect success" = "Connect Success";
"connect failure" = "Connect Failure";
"switch" = "Switch";
